recipes/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
SELECT COUNT(*) FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 1]]
---
    def index
        if params[:sort]
            @recipes = Recipe.all.sort_by do |recipe|
                recipe.ingredients.count