recipes/app/views/recipes/new.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user %>
    <%= f.collection_select :user, User.all, :id, :name %>